{
	"About": {
		"name": "Agustin",
		"lastName": "Rezett",
		"profession": "React Developer",
		"email": "agustin.rezett@gmail.com",
		"profile": "Hi!👋🏻 I am Agustin, a Frontend Developer Ssr. with YEARS_EXPERIENCE+ years of experience in technologies such as React, Redux, and HTML/CSS. Specialized in web interfaces and native applications, I stand out for collaborative leadership and creative problem-solving. Passionate about clean code and innovation. Open to new opportunities. Let's connect to discuss how I can contribute to your team! 🚀",
		"seniority": "Ssr.",
		"linkedin": "https://www.linkedin.com/in/agustin-rezett/?locale=en_US",
		"github": "https://github.com/AgusRezett"
	},
	"MenuNavigationItems": [
		{
			"label": "Experience",
			"value": 1
		},
		{
			"label": "Education",
			"value": 2
		},
		{
			"label": "Projects",
			"value": 3
		},
		{
			"label": "Certificates",
			"value": 4
		}
	],
	"MenuNavigationContent": [
		{
			"id": 1,
			"title": "Experience",
			"content": [
				{
					"title": "Frontend Developer",
					"subtitle": "Lilab",
					"additional": "Lima, Peru",
					"period": "June 2023 - Present",
					"description": "Advanced implementation of unit testing using Jest to ensure the robustness and reliability of React components./sDevelopment and meticulous conversion of interfaces from high-fidelity prototypes to functional code, preserving the integrity of the original design./sEfficient integration of Server-Side Rendering (SSR) into prototypes, guided by User Histories (UH) specifications, optimizing loading and performance./sConducting user-focused demonstrations, highlighting intuitive features and interaction flows./sCoordination and accurate task estimation within the team, fostering effective collaboration and results-oriented approach./sActive contribution to the evolution and improvement of project architecture, focusing on scalability and maintainability./sLeadership in API changes integration and connection with microservices, ensuring smooth and secure communication between systems./sStrategic participation in business model improvement planning, evaluating its impact on user experience and value proposition."
				},
				{
					"title": "Software developer",
					"subtitle": "bdtglobal",
					"additional": "Buenos Aires, Argentina",
					"period": "February 2022 - August 2023 · 1 year 7 month",
					"description": "Successful migration of Cordova applications to React Native./sPresentation of new features, demonstrating both communication and technical skills./sWeekly deployment to a production environment, catering to a broad user base in the insurance industry in Argentina./sEfficient coordination in international projects involving smart contracts on the Polygon network, managing parallel work effectively./sMaintenance and development of user management portals using Laravel and Node technologies, ensuring functionality and performance./sValuable contribution as a design consultant in external project integrations, providing both technical and creative perspectives."
				},
				{
					"title": "Freelance UX/UI Designer & Developer",
					"subtitle": "Freelancer",
					"additional": "Buenos Aires, Argentina",
					"period": "August 2020 - September 2022 · 2 years 2 months",
					"description": "Designing distinctive branding for businesses across various industries, emphasizing versatility and creative adaptability./sSuccessful development of Progressive Web Apps using the PERN stack, ensuring advanced and functional web experiences./sStrategic planning of results and phased estimates, ensuring transparency and efficiency in the process./sEffective communication with clients of diverse age groups, demonstrating skills to understand and meet their expectations for the final product./sOutstanding time management abilities, effectively handling parallel projects with efficiency and commitment."
				},
				{
					"title": "Analyst developer",
					"subtitle": "BDT Group SRL",
					"additional": "Buenos Aires, Argentina",
					"period": "July 2021 - December 2021 · 6 months",
					"description": "Comprehensive design, development, and layout of a portal for the efficient management of thousands of clients in the energy sector in Argentina./sDevelopment of software tailored for the management of virtual notifications in high schools in the Autonomous City of Buenos Aires, enhancing effective communication between the educational institution and the students' parents."
				}
			]
		},
		{
			"id": 2,
			"title": "Education",
			"content": [
				{
					"title": "Fullstack Development - Soy Henry",
					"period": "June 2020 - September 2020"
				},
				{
					"title": "International Baccalaureate",
					"period": "March 2019 - November 2019"
				},
				{
					"title": "Computer technician",
					"period": "March 2018 - December 2021"
				}
			]
		},
		{
			"id": 3,
			"title": "Proyects",
			"content": [
				{
					"title": "Mino - Personal finance app",
					"description": "In Argentina, in January 2022, Red Link recorded a record 43.7 million digital money users and an 87.7% increase in transactions through digital wallets. I created Mino, a free app to centralize funds from digital wallets, bank accounts, and cryptocurrencies, offering users a quick and clear view of their financial status.",
					"hyperlinks": [
						{
							"name": "Mobile design thinking",
							"link": "https://www.behance.net/gallery/147025537/Mino-App-Finanzas-personales"
						},
						{
							"name": "Website (demo)",
							"link": "https://mino-agusrezett.vercel.app/"
						}
					]
				},
				{
					"title": "EcoTech - Promotional site",
					"description": "EcoTech, based in San Luis, Argentina, challenged us to attract potential customers. We developed a website that emphasizes security and trust, is user-friendly, visually appealing, and includes effective calls to action leading to client contact.",
					"hyperlinks": [
						{
							"name": "Interactive prototype",
							"link": "https://www.figma.com/proto/Glal1fjNc3WnNlaHubVr3N/System-Design?node-id=1%3A3&scaling=scale-down&page-id=0%3A1&starting-point-node-id=1%3A3"
						}
					]
				}
			]
		},
		{
			"id": 4,
			"title": "Certificates",
			"content": [
				{
					"title": "English - C1",
					"subtitle": "EF SET",
					"hyperlinks": [
						{
							"name": "View certificate",
							"link": "https://www.efset.org/cert/pfwUTa"
						}
					]
				},
				{
					"title": "UX/UI design",
					"subtitle": "Coderhouse",
					"hyperlinks": [
						{
							"name": "View certificate",
							"link": "https://www.coderhouse.com/certificados/62bb99c4e01bc500192e9d3f?lang=en"
						}
					]
				},
				{
					"title": "Mobile app development",
					"subtitle": "Coderhouse",
					"hyperlinks": [
						{
							"name": "View certificate",
							"link": "https://www.coderhouse.com/certificados/62a93ea3800ddc001b96526c?lang=en"
						}
					]
				},
				{
					"title": "Graphic design and branding",
					"subtitle": "Coderhouse",
					"hyperlinks": [
						{
							"name": "View certificate",
							"link": "https://www.coderhouse.com/certificados/6327ca77215a150024b856ae?lang=en"
						}
					]
				}
			]
		}
	]
}
