{
	"About": {
		"name": "Agust铆n",
		"lastName": "Rezett",
		"profession": "Desarrollador React",
		"email": "agustin.rezett@gmail.com",
		"profile": "Hola! Soy Agust铆n, un desarrollador Frontend Ssr. con +YEARS_EXPERIENCE a帽os de experiencia en tecnolog铆as como React, Redux y Sass. Me especializo en interfaces web y aplicaciones nativas, destacando por liderazgo colaborativo y resoluci贸n creativa de problemas. Estoy abierto a nuevas oportunidades, especialmente aquellas que implementen limpieza de c贸digo y e impulsen innovaci贸n continua. 隆Conectemos para discutir c贸mo puedo contribuir a tu equipo! ",
		"seniority": "Ssr.",
		"linkedin": "https://www.linkedin.com/in/agustin-rezett/",
		"github": "https://github.com/AgusRezett"
	},
	"MenuNavigationItems": [
		{
			"label": "Experiencia",
			"value": 1
		},
		{
			"label": "Educaci贸n",
			"value": 2
		},
		{
			"label": "Proyectos",
			"value": 3
		},
		{
			"label": "Certificados",
			"value": 4
		}
	],
	"MenuNavigationContent": [
		{
			"id": 1,
			"title": "Experiencia",
			"content": [
				{
					"title": "Desarrollador Frontend",
					"subtitle": "Lilab",
					"additional": "Lima, Per煤",
					"period": "Junio 2023 - Actualidad",
					"description": "Implementaci贸n avanzada de pruebas unitarias utilizando Jest para asegurar la robustez y fiabilidad de los componentes React./sDesarrollo y conversi贸n meticulosa de interfaces desde prototipos de alta fidelidad a c贸digo funcional, manteniendo la integridad del dise帽o original./sIntegraci贸n eficiente de Server Side Rendering (SSR) en prototipos, guiado por especificaciones de User Histories (UH), optimizando la carga y el rendimiento./sRealizaci贸n de demostraciones centradas en la experiencia del usuario, destacando funcionalidades y flujos de interacci贸n intuitivos./sCoordinaci贸n y estimaci贸n precisa de tareas dentro del equipo, fomentando una colaboraci贸n eficaz y un enfoque orientado a resultados./sContribuci贸n activa en la evoluci贸n y mejora de la arquitectura de proyectos, enfoc谩ndome en la escalabilidad y mantenibilidad./sLiderazgo en la integraci贸n de cambios de APIs y conexi贸n con microservicios, garantizando una comunicaci贸n fluida y segura entre sistemas./sParticipaci贸n estrat茅gica en la planificaci贸n de mejoras del modelo de negocio, evaluando su impacto en la experiencia del usuario y la propuesta de valor."
				},
				{
					"title": "Desarrollador de software",
					"subtitle": "bdtglobal",
					"additional": "Buenos Aires, Argentina",
					"period": "Febrero 2022 - Agosto 2023 路 1 a帽o 7 meses",
					"description": "Migraci贸n exitosa de aplicaciones Cordova a React Native./sPresentaci贸n de nuevas caracter铆sticas, demostrando habilidades comunicativas y t茅cnicas./sRealizaci贸n de despliegues semanales a entorno de producci贸n, atendiendo a una amplia base de usuarios en la industria de seguros en Argentina./sCoordinaci贸n eficaz en proyectos internacionales de smart-contracts en la red Polygon, gestionando trabajo paralelo de manera efectiva./sMantenimiento y desarrollo de portales de gesti贸n de usuarios utilizando tecnolog铆as Laravel y Node, asegurando funcionalidad y rendimiento./sContribuci贸n valiosa como consultor de dise帽o en integraciones de proyectos externos, aportando perspectivas t茅cnicas y creativas."
				},
				{
					"title": "Dise帽ador UX/UI y Desarrollador Freelance",
					"subtitle": "Freelancer",
					"additional": "Buenos Aires, Argentina",
					"period": "Agosto 2020 - Septiembre 2022 路 2 a帽os 2 meses",
					"description": "Realizaci贸n del dise帽o de branding para negocios de diversas industrias, destacando la versatilidad y adaptabilidad creativa./sDesarrollo exitoso de Progressive Web Apps utilizando el stack PERN, asegurando experiencias web avanzadas y funcionales./sPlanificaci贸n estrat茅gica de resultados y estimaciones por etapas, garantizando transparencia y eficiencia en el proceso./sComunicaci贸n efectiva con clientes de diversas edades, demostrando habilidades para comprender y satisfacer sus expectativas sobre el producto final./sHabilidad destacada en la gesti贸n del tiempo, manejando proyectos de manera paralela con eficacia y compromiso."
				},
				{
					"title": "Analista Desarrollador",
					"subtitle": "BDT Group SRL",
					"additional": "Buenos Aires, Argentina",
					"period": "Julio 2021 - Diciembre 2021 路 6 meses",
					"description": "Realizaci贸n integral del dise帽o, desarrollo y maquetaci贸n de un portal destinado a la eficiente gesti贸n de miles de usuarios de clientes en el sector de la energ铆a en Argentina./sDesarrollo de software espec铆fico para la gesti贸n de notificaciones virtuales en colegios secundarios de la Ciudad Aut贸noma de Buenos Aires, fortaleciendo la comunicaci贸n efectiva entre la instituci贸n educativa y los padres de los estudiantes."
				}
			]
		},
		{
			"id": 2,
			"title": "Educaci贸n",
			"content": [
				{
					"title": "Desarrollo Fullstack - Soy Henry",
					"period": "Enero 2023 - Mayo 2023"
				},
				{
					"title": "Bachillerato Internacional",
					"period": "Marzo 2019 - Noviembre 2019"
				},
				{
					"title": "T茅cnico en computaci贸n",
					"period": "Marzo 2018 - Diciembre 2021"
				}
			]
		},
		{
			"id": 3,
			"title": "Proyectos",
			"content": [
				{
					"title": "Mino - App de finanzas personales",
					"description": "En Argentina, en enero de 2022, Red Link registr贸 un r茅cord de 43.7 millones de usuarios de dinero digital y un aumento del 87.7% en transacciones a trav茅s de billeteras digitales. Cre茅 Mino, una app gratuita para centralizar fondos de billeteras digitales, cuentas bancarias y criptomonedas, ofreciendo una visi贸n r谩pida y clara del estado financiero del usuario.",
					"hyperlinks": [
						{
							"name": "App design thinking",
							"link": "https://www.behance.net/gallery/147025537/Mino-App-Finanzas-personales"
						},
						{
							"name": "Sitio web (demo)",
							"link": "https://mino-agusrezett.vercel.app/"
						}
					]
				},
				{
					"title": "EcoTech - Sitio promocional",
					"description": "EcoTech, con sede en San Luis, Argentina, nos desafi贸 a atraer clientes potenciales. Desarrollamos un sitio web que enfatiza la seguridad y la confianza, es f谩cil de usar, visualmente atractivo e incluye llamadas a la acci贸n efectivas que conducen al contacto con el cliente.",
					"hyperlinks": [
						{
							"name": "Prototipo interactivo",
							"link": "https://www.figma.com/proto/Glal1fjNc3WnNlaHubVr3N/System-Design?node-id=1%3A3&scaling=scale-down&page-id=0%3A1&starting-point-node-id=1%3A3"
						}
					]
				}
			]
		},
		{
			"id": 4,
			"title": "Certificados",
			"content": [
				{
					"title": "Ingl茅s - C1",
					"subtitle": "EF SET",
					"hyperlinks": [
						{
							"name": "Ver certificado",
							"link": "https://www.efset.org/cert/pfwUTa"
						}
					]
				},
				{
					"title": "Dise帽o UX/UI",
					"subtitle": "Coderhouse",
					"hyperlinks": [
						{
							"name": "Ver certificado",
							"link": "https://www.coderhouse.com/certificados/62bb99c4e01bc500192e9d3f"
						}
					]
				},
				{
					"title": "Desarrollo de aplicaciones m贸viles",
					"subtitle": "Coderhouse",
					"hyperlinks": [
						{
							"name": "Ver certificado",
							"link": "https://www.coderhouse.com/certificados/62a93ea3800ddc001b96526c"
						}
					]
				},
				{
					"title": "Curso de OKRs",
					"subtitle": "Platzi",
					"hyperlinks": [
						{
							"name": "Ver certificado",
							"link": "https://platzi.com/p/agustin.rezett/curso/3146-course/diploma/detalle/"
						}
					]
				},
				{
					"title": "Dise帽o gr谩fico y branding",
					"subtitle": "Coderhouse",
					"hyperlinks": [
						{
							"name": "Ver certificado",
							"link": "https://www.coderhouse.com/certificados/6327ca77215a150024b856ae"
						}
					]
				}
			]
		}
	]
}
